"Part1" = "BẢN TIẾNG VIỆT";
"Part2" = "APPLE INC.";
"Part3" = "HỢP ĐỒNG CẤP QUYỀN SỬ DỤNG PHẦN MỀM SHORTCUTS CHO iOS";
"Part4" = "XIN VUI LÒNG ĐỌC KỸ HỢP ĐỒNG CẤP QUYỀN SỬ DỤNG PHẦN MỀM NÀY (“HỢP ĐỒNG CẤP QUYỀN SỬ DỤNG”) TRƯỚC KHI SỬ DỤNG PHẦN MỀM APPLE. BẰNG VIỆC SỬ DỤNG PHẦN MỀM APPLE, BẠN ĐỒNG Ý CHỊU RÀNG BUỘC BỞI CÁC ĐIỀU KHOẢN CỦA HỢP ĐỒNG CẤP QUYỀN SỬ DỤNG NÀY. NẾU BẠN KHÔNG ĐỒNG Ý VỚI CÁC ĐIỀU KHOẢN CỦA HỢP ĐỒNG CẤP QUYỀN SỬ DỤNG NÀY, ĐỀ NGHỊ KHÔNG CÀI ĐẶT VÀ/HOẶC SỬ DỤNG PHẦN MỀM.";
"Part5" = "LƯU Ý QUAN TRỌNG: Nếu phần mềm này được sử dụng để tạo bản sao, chỉnh sửa, công bố và phân phối các tài liệu, bạn chỉ được cấp quyền tạo bản sao, chỉnh sửa, công bố, và phân phối các tài liệu không có bản quyền, các tài liệu mà bạn sở hữu bản quyền, hoặc các tài liệu mà bạn được trao quyền hoặc được phép tạo bản sao, chỉnh sửa, công bố hoặc phân phối một cách hợp pháp. Nếu bạn không chắc chắn về quyền của mình được sao chép, chỉnh sửa, công bố hoặc phân phối bất kỳ tài liệu nào, bạn nên liên hệ với cố vấn pháp lý của bạn. ";
"Part6" = "1. Quy Định Chung. ";
"Part7" = "A. Phần mềm Apple và bất kỳ phần mềm của bên thứ ba, tài liệu, các giao diện, nội dung, các phông chữ, và bất kỳ dữ liệu nào kèm theo Hợp Đồng Cấp Quyền Sử Dụng này dù ở trong bộ nhớ chỉ đọc, trên bất kỳ phương tiện ghi nào hoặc dưới bất kỳ dạng thức nào khác (được gọi chung là “Phần Mềm Apple”), được Apple Inc. (“Apple”) cho phép bạn được sử dụng, mà không bán cho bạn, và chỉ được sử dụng theo quy định tại các điều khoản của Hợp Đồng Cấp Quyền Sử Dụng này. Apple và/hoặc các bên cấp quyền sử dụng cho Apple giữ quyền sở hữu đối với chính Phần Mềm Apple và bảo lưu tất cả các quyền không được cấp cho bạn một cách rõ ràng. ";
"Part8" = "B. Theo sự định đoạt của mình, Apple có thể cung cấp các nâng cấp hoặc cập nhật của Phần Mềm Apple trong tương lai cho thiết bị dùng hệ điều hành iOS hiệu Apple tương thích của bạn. Các nâng cấp và cập nhật Phần Mềm Apple, nếu có, có thể không nhất thiết phải bao gồm tất cả các tính năng của phần mềm hiện tại hoặc các tính năng mới mà Apple phát hành cho các mẫu mới hơn hoặc các mẫu khác của các thiết bị dung hệ điều hành iOS. Các điều khoản của Hợp Đồng Cấp Quyền Sử Dụng này sẽ điều chỉnh bất kỳ nâng cấp hoặc cập nhật phần mềm nào được cung cấp bởi Apple cho sản phẩm Phần Mềm Apple gốc, trừ khi bản nâng cấp hoặc cập nhật đó được cung cấp kèm theo một hợp đồng cấp quyền sử dụng riêng thì bạn đồng ý rằng các điều khoản của hợp đồng cấp quyền sử dụng đó sẽ điều chỉnh nâng cấp hoặc cập nhật đó. ";
"Part9" = "2. Phạm Vi Sử Dụng Được Phép và Các Hạn Chế.";
"Part10" = "A. Cấp Quyền Sử Dụng. Phụ thuộc vào các điều khoản và điều kiện của Hợp Đồng Cấp Quyền Sử Dụng này và như được cho phép theo “Nguyên Tắc Sử Dụng Dịch Vụ và Nội Dung” được nêu trong Các Điều Khoản và Điều Kiện Dịch Vụ Apple Media (https://www.apple.com/legal/internet-services/itunes/ (“Nguyên Tắc Sử Dụng”), trừ khi bạn có được Phần Mềm Apple theo cách như được nêu tại Mục 2B, bạn được cấp quyền sử dụng hạn chế, không được phép chuyển nhượng, không độc quyền để cài đặt và sử dụng Phần Mềm Apple cho bất kỳ thiết bị dùng hệ điều hành iOS hiệu Apple tương thích nào mà bạn sở hữu hoặc quản lý. Bạn không được phân phối hoặc cung cấp Phần Mềm Apple qua một môi trường mạng nơi mà Phần Mềm Apple có thể được sử dụng bởi nhiều thiết bị cùng một lúc. Bạn không được thuê, cho thuê, cho mượn, bán, phân phối lại hoặc cấp lại quyền sử dụng Phần Mềm Apple. ";
"Part11" = "B. Cấp Quyền Sử Dụng Theo Số Lượng hoặc Duy Trì. Nếu bạn nhận được Phần Mềm Apple theo một chương trình cấp quyền sử dụng theo số lượng hoặc duy trì với Apple, các điều khoản của hợp đồng cấp quyền sử dụng theo số lượng hoặc duy trì sẽ quyết định số lượng bản sao Phần Mềm Apple mà bạn được phép tải về, cài đặt, sử dụng, và chạy trên các thiết bị dùng hệ điều hành iOS hiệu Apple mà bạn sở hữu hoặc quản lý. Trừ khi được Apple đồng ý bằng văn bản, tất cả các điều khoản và điều kiện khác của Hợp Đồng Cấp Quyền Sử Dụng này sẽ điều chỉnh việc bạn sử dụng Phần Mềm Apple mà bạn có được theo hợp đồng cấp quyền sử dụng theo số lượng hoặc duy trì. ";
"Part12" = "C. Các Yêu Cầu Hệ Thống. Phần Mềm Apple chỉ được hỗ trợ trên phần cứng hiệu Apple đáp ứng các yêu cầu hệ thống cụ thể theo quy định của Apple.";
"Part13" = "D. Nội Dung và Tài Liệu Số. Quyền sở hữu và các quyền sở hữu trí tuệ trong và đối với bất kỳ nội dung nào, bao gồm các nhãn hiêu, logo và hình ảnh, được hiển thị bởi hoặc được truy cập thông qua Phần Mềm Apple thuộc về chủ sở hữu nội dung tương ứng. Nội dung này có thể được bảo vệ bởi các quy định pháp luật và điều ước về bản quyền, nhãn hiệu hoặc sở hữu trí tuệ khác, và có thể phụ thuộc vào các điều khoản sử dụng của bên thứ ba cung cấp nội dung đó. Trừ khi Hợp Đồng Cấp Quyền Sử Dụng này có quy định khác, (i) Hợp Đồng Cấp Quyền Sử Dụng này không cấp cho bạn bất kỳ quyền nào để sử dụng nội dung đó và cũng không bảo đảm rằng nội dung đó sẽ tiếp tục được cung cấp cho bạn và (ii) bạn khôngđược sử dụng, trích hoặc phân phối một cách riêng lẻ, dù là dưới hình thức thương mại hay hình thức khác, bất kỳ ảnh chụp, logo, chữ, mã, hình ảnh, đồ họa, tác phẩm nghệ thuật, âm thanh, video hoặc các tài sản tương tự (“Tài Liệu Số”) được bao gồm trong, hoặc được cung cấp như là một phần của Phần Mềm Apple hoặc sử dụng Tài Liệu Số theo cách khác ngoài phạm vi sử dụng được phép như là một phần của Phần Mềm Apple.";
"Part14" = "E. Sử Dụng Shortcuts. Bạn thừa nhận rằng tất cả những tổ hợp tắt cho các hành động ứng dụng và/hoặc website (“Shortcuts”) thuộc về trách nhiệm duy nhất của bên hoặc các bên tạo ra các Shortcuts đó. Apple không có quyền kiểm soát đối với, và không nhận trách nhiệm đối với, nội dung hoặc chức năng của bất kỳ Shortcut của bên thứ ba nào. Bạn đồng ý chịu toàn bộ rủi ro khi sử dụng bất kỳ Shortcut nào và bạn chịu trách nhiệm hoàn toàn đối với việc tuân thủ bất kỳ các điều khoản hoặc thỏa thuận bên thứ ba nào phát sinh từ việc bạn sử dụng bất kỳ Shortcut nào. Bạn thừa nhận rằng Apple không có nghĩa vụ phải xem xét trước các Shortcuts, tuy nhiên Apple bảo lưu quyền theo sự định đoạt của mình để xem xét trước, từ chối, vô hiệu hóa hoặc gỡ bỏ bất kỳ Shortcut nào.";
"Part15" = "F. Chia sẻ Shortcuts. Phần Mềm Apple có thể cho phép bạn chia sẻ các Shortcuts mà bạn tạo ra cho những người khác thông qua một đường dẫn web. Các Shortcuts được chia sẻ của bạn, cùng với các nội dung được bao hàm trong đó, sẽ được lưu trên các máy chủ Apple vì mục đích cho phép việc chia sẻ đó và có thể được dùng để cải thiện tính năng các sản phẩm và dịch vụ của Apple một cách nói chung. Các Shortcuts được chia sẻ của bạn, cùng với các nội dung được bao hàm trong đó, sẽ được cung cấp cho bất kỳ người nào truy cập vào đường dẫn web, người đó có thể tạo bản sao, lưu, chỉnh sửa và phân phối lại một bản sao của Shortcut của bạn và tất cả các nội dung bao hàm trong đó. Bằng việc chia sẻ một Shortcut, bạn cam kết rằng: (1) bạn được cấp phép và có tất cả các quyền cần thiết đối với Shortcut đó và việc chia sẻ đó sẽ không vi phạm các quyền của bất kỳ bên thứ ba nào; và (2) bất kỳ Shortcut nào mà bạn chia sẻ không vi phạm bất kỳ quy định pháp luật nào, góp phần vào hoặc khuyến khích việc vi phạm hoặc bất kỳ hành vi bất hợp pháp nào khác, hoặc là quá đáng hoặc phản cảm. Bạn thừa nhận rằng Apple không có nghĩa vụ phải đánh giá các Shortcut mà bạn chia sẻ, tuy nhiên Apple bảo lưu quyền theo sự định đoạt của mình để đánh giá, từ chối, vô hiệu hóa hoặc gỡ bỏ bất kỳ Shortcut nào mà bạn chia sẻ.";
"Part16" = "G. Hạn Chế Sử Dụng. Bạn đống ý không: tải lên, đăng tải, gửi thư điện tử, truyền tín hiệu, chia sẻ hoặc cung cấp bằng một cách nào khác các Shortcut mà: (1) là bất hợp pháp, có hại, ảnh hưởng đến danh dự, thô tục, quá đáng, bôi nhọ hoặc phân biệt chúng tộc, phân biệt dân tộc hoặc có thể bị phản đối theo một cách khác; (2) vi phạm, hoặc khuyến khích bất kỳ hành vi nào, có thể vi phạm bất kỳ luật hoặc quy định áp dụng nào hoặc có thể gây ra trách nhiệm dân sự; (3) khuyến khích sự phân biệt, cuồng tín, phân biệt chủng tộc, thù ghét, xâm phạm hoặc có hại đối với bất kỳ cá nhân hoặc nhóm người nào; (4) là bạo lực hoặc đe dọa, hoặc khuyến khích bạo lực hoặc các hành động đe dọa với bất kỳ người nào khác; (5) khuyến khích các hoạt động bất hợp pháp hoặc có hại; (6) mà bạn biết hoặc tin là sai, gây nhầm lẫn, giả tạo hoặc lừa dối bằng bất kỳ cách nào khác đối với một người sử dụng Shortcut đó. Bạn đồng ý thêm rằng bạn sẽ không can thiệp vào, làm gián đoạn, hoặc tạo ra gánh nặng không cần thiết đối với các máy chủ và mạng được kết nối với Phần Mềm Apple hoặc bất kỳ ứng dụng, dịch vụ hoặc trang web phần mềm bên thứ ba nào trên thiết bị dùng hệ điều hành iOS của bạn (“Ứng Dụng Bên Thứ Ba”) hoặc vi phạm các quy định, chính sách hoặc thủ tục của các mạng hoặc Ứng Dụng Bên Thứ Ba đó.";
"Part17" = "H. Ứng Dụng Bên Thứ Ba. Để có thể thực hiện bất kỳ Shortcut nào, Phần Mềm Apple có thể cần phải truy cập và một số Ứng Dụng Bên Thứ Ba cụ thể. Bạn đồng ý một cách rõ ràng và cấp quyền cho Phần Mềm Apple được truy cập và sử dụng các Ứng Dụng Bên Thứ Ba đó thay mặt cho bạn trong phạm vi cần thiết để thực hiện Shortcut đó với Phần Mềm Apple. Trong phạm vi Phần Mềm Apple truy cập vào bất kỳ Ứng Dụng Bên Thứ Ba nào; Apple không có nghĩa vụ rõ ràng hoặc ngầm định phải cung cấp hỗ trợ kỹ thuật hoặc hỗ trợ khác cho các Ứng Dụng Bên Thứ Ba đó. Đề nghị liên lạc trực tiếp với người bán, nhà sản xuất phần mềm hoặc bên cung cấp dịch vụ để có được sự hỗ trợ kỹ thuật và dịch vụ khách hàng liên quan đến phần mềm, dịch vụ, trang web và/hoặc sản phẩm của bên đó. BẠN ĐỒNG Ý THÊM RẰNG BẠN SẼ BỊ RÀNG BUỘC BỞI, VÀ ĐỒNG Ý TUÂN THỦ, TẤT CẢ CÁC ĐIỀU KHOẢN DỊCH VỤ HOẶC CÁC THỎA THUẬN KHÁC ÁP DỤNG ĐỐI VỚI CÁC ỨNG DỤNG BÊN THỨ BA ĐÓ KHI SỬ DỤNG PHẦN MỀM APPLE. BẠN CHỊU TRÁCH NHIỆM HOÀN TOÀN CHO VIỆC ĐẢM BẢO RẰNG TẤT CẢ CÁC SHORTCUT TUÂN THỦ CÁC ĐIỀU KHOẢN ÁP DỤNG ĐỐI VỚI MỖI ỨNG DỤNG BÊN THỨ BA ĐƯỢC SỬ DỤNG BỞI SHORTCUT ĐÓ. APPLE KHÔNG ĐẢM BẢO BẰNG BẤT KỲ HÌNH THỨC NÀO RẰNG CÁC SHORTCUT ĐÓ TUÂN THỦ VỚI CÁC ĐIỀU KHOẢN CỦA BẤT KỲ ỨNG DỤNG BÊN THỨ BA NÀO VÀ APPLE KHÔNG CHỊU TRÁCH NHIỆM ĐỐI VỚI BẤT KỲ SHORTCUT BÊN THỨ BA NÀO.";
"Part18" = "I. Không Thiết Kế Đối Chiếu. Bạn không và bạn đồng ý không, cũng như không cho phép người khác, sao chép (trừ khi được Hợp Đồng Cấp Quyền Sử Dụng này hoặc Nguyên Tắc Sử Dụng cho phép một cách rõ ràng nếu các tài liệu này áp dụng đối với bạn), phá biên dịch, thiết kế đối chiếu, tách rời, cố gắng để tìm được mã nguồn, giải mã, thay đổi, hoặc tạo ra các tác phẩm phái sinh của Phần Mềm Apple hoặc của các dịch vụ do Phần Mềm Apple cung cấp, hoặc bất kỳ phần nào của Phần Mềm Apple hoặc của các dịch vụ đó (trừ khi và chỉ trong phạm vi các hạn chế nêu trên bị luật áp dụng cấm hoặc trong phạm vi được các điều khoản cấp quyền sử dụng điều chỉnh việc sử dụng các thành phần nguồn mở bao gồm trong Phần Mềm Apple cho phép). ";
"Part19" = "J. Tuân Thủ Pháp Luật. Bạn đồng ý sử dụng Phần Mềm Apple và các Dịch Vụ (như được định nghĩa tại Phần 4 dưới đây) tuân theo quy định của tất cả các luật áp dụng, bao gồm luật của quốc gia hoặc khu vực nơi bạn cư trú hoặc nơi bạn tải về và sử dụng Phần Mềm Apple và các Dịch Vụ.";
"Part20" = "K. Tự Động Cập Nhật. Nếu bạn lựa chọn cho phép chức năng tự động cập nhật, thiết bị của bạn sẽ định kỳ kiểm tra với Apple về các cập nhật và nâng cấp cho Phần Mềm Apple và, nếu một cập nhật hoặc nâng cấp được cung cấp thì cập nhật hoặc nâng cấp đó sẽ tự động được tải về và cài đặt trên thiết bị của bạn vàcác thiết bị ngoại vi của bạn, nếu phù hợp. Bạn có thể tắt tất cả các cập nhật ứng dụng tự động vào bất kỳ thời điểm nào bằng cách đổi cài đặt ứng dụng tự động cập nhật trong phần Cài Đặt (Settings). ";
"Part21" = "3. Chấp Thuận Cho Việc Sử Dụng Dữ Liệu. ";
"Part22" = "A. Dữ Liệu Phân Tích. Nếu bạn chọn tham gia thu thập dữ liệu Phân Tích, bạn đồng ý rằng Apple và các công ty con và các đại lý của Apple có thể thu thập, lưu giữ, xử lý và sử dụng các thông tin chẩn đoán, kỹ thuật, sử dụng và các thông tin liên quan, bao gồm nhưng không giới hạn ở các nhận dạng phần cứng hoặc hệ thống duy nhất, thông tin về thiết bị dùng hệ điều hành iOS, máy tính, hệ thống và phần mềm ứng dụng, và các thiết bị ngoại vi của bạn, các thông tin này được thu thập theo định kỳ để cung cấp và cải thiện tính năng các sản phẩm và dịch vụ của Apple, tạo điều kiện thuận lợi cho việc cung cấp cho bạn các cập nhật phần mềm, hỗ trợ sản phẩm và các dịch vụ khác (nếu có) liên quan tới Phần Mềm Apple, và để kiểm tra việc tuân thủ các điều khoản của Hợp Đồng Cấp Quyền Sử Dụng này. Apple có thể sử dụng thông tin này cho các mục đích nêu trên, với điều kiện là thông tin được thu thập ở dạng không xác định rõ cá nhân bạn. Để cho phép các đối tác của Apple và bên thiết kế thứ ba cải thiện phần mềm, phần cứng, và dịch vụ của họ được thiết kế để sử dụng với các sản phẩm Apple, Apple cũng có thể cung cấp cho đối tác hoặc bên phát triển thứ ba đó một phần thông tin chẩn đoán có liên quan đến phần mềm, phần cứng, và/hoặc các dịch vụ của đối tác hoặc bên phát triển đó với điều kiện là thông tin chẩn đoán ở dạng không xác định rõ cá nhân bạn. ";
"Part23" = "B. Dữ Liệu Định Vị. Apple và các đối tác của Apple, các bên được Apple cấp quyền sử dụng và các bên phát triển thứ ba có thể cung cấp một số dịch vụ thông qua Phần Mềm Apple dựa trên thông tin định vị. Để cung cấp các dịch vụ này, khi phù hợp, Apple và các đối tác của Apple, các bên được Apple cấp quyền sử dụng và các bên phát triển thứ ba có thể chuyển, thu thập, lưu giữ, xử lý và sử dụng dữ liệu định vị của bạn. Dữ liệu và các yêu cầu định vị được Apple thu thập dưới dạng không xác định rõ cá nhân bạn và có thể được Apple và các đối tác của Apple, các bên được Apple cấp quyền sử dụng và các bên phát triển thứ ba sử dụng để cung cấp và cải thiện tính năng các sản phẩm và dịch vụ dựa trên sự định vị. Bằng việc sử dụng bất kỳ dịch vụ dựa trên sự định vị nào được cung cấp bởi hoặc thông qua Phần Mềm Apple, bạn đồng ý và chấp thuận việc Apple và các đối tác của Apple, các bên được Apple cấp quyền sử dụng và các bên phát triển thứ ba chuyển, thu thập, lưu giữ, xử lý và sử dụng dữ liệu và các yêu cầu định vị của bạn để cung cấp và cải thiện tính năng các sản phẩm và dịch vụ này. Bạn có thể rút lại chấp thuận này bất kỳ thời điểm nào bằng cách vào phần cài đặt Dịch Vụ Định Vị trong thiết bị dùng hệ điều hành iOS của bạn và tắt cài đặt Dịch Vụ Định Vị chung hoặc tắt từng cài đặt định vị riêng cho Phần Mềm Apple. Khi bạn sử dụng các ứng dụng hoặc dịch vụ của bên thứ ba trên thiết bị dùng hệ điều hành iOS mà sử dụng hoặc cung cấp dữ liệu định vị, bạn bị ràng buộc và phải tuân thủ các điều khoản và chính sách quyền riêng tư của bên thứ ba đó đối với việc sử dụng dữ liệu định vị do các ứng dụng hoặc dịch vụ của bên thứ ba đó tạo ra. ";
"Part24" = "C. Chính Sách Quyền Riêng Tư. Vào mọi thời điểm, thông tin của bạn sẽ được xử lý phù hợp với Chính Sách Quyền Riêng Tư của Apple mà bạn có thể xem tại địa chỉ: https://www.apple.com/legal/privacy/.  ";
"Part25" = "4. Các Dịch Vụ và Tài Liệu của Bên Thứ Ba.";
"Part26" = "A. Quy Định Chung. Phần Mềm Apple cho phép bạn truy cập vào iTunes Store, App Store, iCloud, Maps của Apple và các dịch vụ và trang web khác của Apple và của bên thứ ba (sau đây được gọi chung và gọi riêng là “Dịch Vụ”). Các Dịch Vụ này có thể không được cung cấp bằng tất cả các thứ tiếng hoặc tại tất cả các quốc gia. Để sử dụng các Dịch Vụ này, bạn cần phải truy cập vào Internet và để sử dụng một số Dịch Vụ cần phải có ID Apple, bạn có thể phải chấp nhận các điều khoản bổ sung và có thể phải trả các khoản phí bổ sung. Bằng việc sử dụng phần mềm này cùng với một tài khoản iTunes Store, ID Apple hoặc Dịch Vụ Apple khác, bạn đồng ý chấp nhận các điều khoản dịch vụ áp dụng đối với Dịch Vụ đó, ví dụ như các Điều Khoản và Điều Kiện Dịch Vụ Apple Media mới nhất mà bạn có thể truy cập và xem tại địa chỉ https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. Nếu bạn chọn sử dụng các dịch vụ iCloud thông qua Phần Mềm Apple, việc sử dụng này phụ thuộc vào các điều khoản bổ sung sau: Các Điều Khoản và Điều Kiện iCloud được đăng tải tại https://www.apple.com/legal/internet-services/icloud/ và Chính Sách Quyền Riêng Tư của Apple được đăng tải tại https://www.apple.com/legal/privacy/.";
"Part28" = "C. Bạn hiểu rằng khi sử dụng bất kỳ Dịch Vụ nào, bạn có thể gặp phải nội dung có thể có tính công kích, khiếm nhã, hoặc không mong muốn, nội dung này có thể bị coi là hoặc không bị coi là có tính mô tả tình dục. Tuy nhiên, bạn đồng ý chịu toàn bộ các rủi ro khi sử dụng các Dịch Vụ và Apple sẽ không có bất kỳ nghĩa vụ nào với bạn đối với nội dung có thể bị coi là có tính công kích, khiếm nhã, hoặc không mong muốn.";
"Part29" = "D. Một số Dịch Vụ có thể thể hiện, chứa đựng hoặc cung cấp dịch vụ, nội dung, dữ liệu, thông tin, các ứng dụng hoặc tài liệu từ bên thứ ba (“Tài Liệu Của Bên Thứ Ba”) hoặc tạo ra đường dẫn liên kết tới các trang web hoặc ứng dụng của các bên thứ ba. Bằng việc sử dụng các Dịch Vụ, bạn thừa nhận và đồng ý rằng Apple sẽ không có trách nhiệm kiểm tra hoặc đánh giá nội dung, tính chính xác, tính hoàn thiện, tính hợp thời, hiệu lực, tuân thủ quy định về bản quyền, tính hợp pháp, tuân thủ các quy tắc, chất lượng hoặc các khía cạnh khác của các Tài Liệu Của Bên Thứ Ba, các ứng dụng hoặc các trang web. Apple, các nhân viên, công ty liên kết và công ty con của Apple không bảo đảm hoặc xác nhận và không chịu và sẽ không có bất kỳ trách nhiệm hoặc nghĩa vụ nào với bạn hoặc bất kỳ người nào về các Dịch Vụ của bất kỳ bên thứ ba nào, Tài Liệu Của Bên Thứ Ba, các ứng dụng hoặc các trang web, hoặc các tài liệu, sản phẩm, hoặc dịch vụ khác của các bên thứ ba. Các Tài Liệu Của Bên Thứ Ba và các đường dẫn liên kết tới các trang web hoặc ứng dụng khác được cung cấp với mục đích duy nhất là nhằm tạo thuận lợi cho bạn. ";
"Part30" = "E. Nếu bạn tải lên bất kỳ nội dung nào thông qua việc sử dụng các Dịch Vụ, bạn cam kết rằng bạn sở hữu tất cả các quyền đối với nội dung đó, hoặc được cấp quyền hoặc theo cách khác được cho phép một cách hợp pháp để tải lên nội dung đó và nội dung đó không vi phạm bất kỳ điều khoản dịch vụ nào áp dụng đối với các Dịch Vụ. Bạn đồng ý rằng các Dịch Vụ bao gồm nội dung, thông tin và tài liệu, bao gồm nhưng không giới hạn ở bất kỳ Tài Liệu Số nào, thuộc sở hữu riêng của Apple, chủ sở hữu trang thông tin điện tử và/hoặc các bên cấp quyền sử dụng cho Apple/chủ sở hữu trang thông tin điện tử, và được bảo vệ bởi các quy định về sở hữu trí tuệ và các luật khác, bao gồm nhưng không chỉ giới hạn bởi bản quyền. Bạn đồng ý rằng bạn sẽ không sử dụng các nội dung, thông tin và tài liệu đó trừ các trường hợp việc sử dụng các Dịch Vụ được phép và không sử dụng các nội dung, thông tin và tài liệu theo cách thức trái với các điều khoản của Hợp Đồng Cấp Quyền Sử Dụng này và không vi phạm bất kỳ quyền sở hữu trí tuệ nào của một bên thứ ba hoặc của Apple. Không phần nào của các Dịch Vụ có thể được sao chép dưới bất kỳ hình thức nào bằng bất kỳ phương tiện nào. Bạn đồng ý không sửa đổi, thuê, cho thuê, bán, phân phối, hoặc tạo ra các tác phẩm phái sinh dựa trên các Dịch Vụ, theo bất kỳ cách nào, và bạn sẽ không khai thác các Dịch vụ theo bất kỳ cách nào không được phép, bao gồm và không giới hạn bởi việc sử dụng Dịch Vụ để phát tán bất kỳ virus, sâu máy tính, ngựa thành Troy hoặc phần mềm gây hại khác, hoặc việc xâm phạm hoặc làm cho mạng bị quá tải. Bạn đồng ý thêm rằng sẽ không sử dụng các Dịch Vụ theo bất kỳ hình thức nào để gây rối, lạm dụng, lén lút theo dõi, đe dọa, gây tổn hại danh dự hoặc bằng cách nào khác xâm phạm hoặc vi phạm các quyền của bất kỳ bên nào khác, và rằng Apple hoàn toàn không có trách nhiệm đối với bất kỳ việc sử dụng nào của bạn hoặc đối với bất kỳ tin nhắn hay thông điệp gây rối, đe dọa, gây tổn hại danh dự, công kích, vi phạm hoặc bất hợp pháp nào mà bạn có thể nhận được khi sử dụng bất kỳ Dịch Vụ nào.";
"Part31" = "F. Hơn nữa, các Dịch Vụ và các Tài Liệu Của Bên Thứ Ba có thể được truy cậptừ, được hiển thị trên hoặc được liên kết đến từ Phần Mềm Apple có thể không được cung cấp bằng tất cả các thứ tiếng hoặc tại tất cả các quốc gia hoặc khu vực. Apple không cam kết rằng các Dịch Vụ và các Tài Liệu Của Bên Thứ Ba được cung cấp hoặc phù hợp cho việc sử dụng tại bất kỳ địa điểm cụ thể nào. Trong phạm vi mà bạn chọn sử dụng hoặc truy cập vào các Dịch Vụ hoặc các Tài Liệu Của Bên Thứ Ba này, bạn tự mình làm việc này và tự chịu trách nhiệm về việc tuân thủ luật áp dụng, bao gồm nhưng không chỉ giới hạn bởi luật áp dụng của quốc gia sở tại và các luật về quyền riêng tư và thu thập dữ liệu. Apple và các bên cấp quyền sử dụng cho Apple bảo lưu quyền thay đổi, đình chỉ, hủy bỏ, hoặc vô hiệu hóa việc truy cập vào bất kỳ Dịch Vụ nào vào bất kỳ thời điểm nào mà không cần thông báo. Trong bất kỳ trường hợp nào, Apple không chịu trách nhiệm đối với sự hủy bỏ hoặc vô hiệu hóa việc truy cập bất kỳ Dịch Vụ nào. Apple cũng có thể áp đặt các hạn chế đối với việc sử dụng hoặc truy cập một số Dịch Vụ trong bất kỳ trường hợp nào mà không cần thông báo cũng như không phải chịu bất kỳ trách nhiệm nào.";
"Part32" = "5. Chấm Dứt. Hợp Đồng Cấp Quyền Sử Dụng này sẽ có hiệu lực cho đến khi bị chấm dứt. Quyền của bạn theo quy định tại Hợp Đồng Cấp Quyền Sử Dụng này sẽ tự động chấm dứt hoặc chấm dứt hiệu lực theo cách khác mà Apple không cần phải thông báo nếu bạn không tuân thủ bất kỳ điều khoản nào của Hợp Đồng Cấp Quyền Sử Dụng này. Khi Hợp Đồng Cấp Quyền Sử Dụng này chấm dứt, bạn sẽ phải chấm dứt hoàn toàn việc sử dụng Phần Mềm Apple và phải hủy tất cả các bản sao, toàn bộ hoặc một phần, của Phần Mềm Apple. Các Phần 2I, 3, 4, 5, 6, 7, 8, 10 và 11 của Hợp Đồng Cấp Quyền Sử Dụng này tiếp tục có hiệu lực sau khi xảy ra bất kỳ trường hợp chấm dứt nào như vậy.";
"Part33" = "6. Từ Bỏ Các Bảo Đảm. ";
"Part34" = "A.  Nếu bạn là một khách hàng tiêu dùng (bạn sử dụng Phần Mềm Apple không cho mục đích kinh doanh, thương mại, hoặc công việc của bạn), bạn có thể có các quyền hợp pháp tại quốc gia bạn cư trú mà các quyền đó có thể cấm áp dụng các hạn chế sau đây đối với bạn, và trong trường hợp đó thì các hạn chế sau đây sẽ không áp dụng đối với bạn. Để biết thêm về các quyền của người tiêu dùng, bạn nên liên hệ với tổ chức tư vấn cho người tiêu dùng tại địa phương.";
"Part35" = "B.  TRONG PHẠM VI LUẬT ÁP DỤNG CHO PHÉP, BẠN CÔNG KHAI THỪA NHẬN VÀ ĐỒNG Ý CHỊU MỌI RỦI RO TRONG VIỆC SỬ DỤNG PHẦN MỀM APPLE VÀ BẤT KỲ DỊCH VỤ NÀO ĐƯỢC THỰC HIỆN BỞI HOẶC ĐƯỢC TRUY CẬP THÔNG QUA PHẦN MỀM APPLE VÀ BẠN HOÀN TOÀN CHỊU MỌI RỦI RO VỀ VIỆC CHẤT LƯỢNG, KHẢ NĂNG HOẠT ĐỘNG, ĐỘ CHÍNH XÁC, VÀ KẾT QUẢ CÓ THỎA MÃN YÊU CẦU CỦA BẠN HAY KHÔNG. ";
"Part36" = "C.  TRONG PHẠM VI TỐI ĐA MÀ LUẬT ÁP DỤNG CHO PHÉP, PHẦN MỀM APPLE VÀ CÁC DỊCH VỤ ĐƯỢC CUNG CẤP “THEO NGUYÊN TRẠNG” VÀ “NHƯ HIỆN CÓ”, VỚI TẤT CẢ CÁC LỖI VÀ KHÔNG CÓ BẤT KỲ SỰ BẢO ĐẢM NÀO, VÀ APPLE VÀ CÁC BÊN CẤP QUYỀN SỬ DỤNG CHO APPLE (ĐƯỢC GỌI CHUNG LÀ “APPLE” CHO CÁC MỤC ĐÍCH CỦA PHẦN 6 VÀ 7) THEO ĐÂY TỪ BỎ MỌI BẢO ĐẢM VÀ ĐIỀU KIỆN LIÊN QUAN TỚI PHẦN MỀM APPLE VÀ CÁC DỊCH VỤ, DÙ LÀ CÔNG KHAI, NGẦM ĐỊNH HOẶC THEO QUY ĐỊNH, BAO GỒM VÀ KHÔNG GIỚI HẠN BỞI CÁC BẢO ĐẢM VÀ/HOẶC ĐIỀU KIỆN NGẦM ĐỊNH VỀ KHẢ NĂNG TIÊU THỤ, CHẤT LƯỢNG ĐẢM BẢO, PHÙ HỢP CHO MỘT MỤC ĐÍCH SỬ DỤNG CỤ THỂ, ĐỘ CHÍNH XÁC, ĐỘ HÀI LÒNG KHI SỬ DỤNG, VÀ KHÔNG VI PHẠM QUYỀN CỦA BÊN THỨ BA. ";
"Part37" = "D.  APPLE KHÔNG BẢO ĐẢM RẰNG VIỆC SỬ DỤNG PHẦN MỀM APPLE VÀ CÁC DỊCH VỤ CỦA BẠN KHÔNG BỊ GIÁN ĐOẠN, KHÔNG BẢO ĐẢM RẰNG CÁC CHỨC NĂNG TRONG PHẦN MỀM APPLE, HOẶC CÁC DỊCH VỤ ĐƯỢC THỰC HIỆN HOẶC CUNG CẤP BỞI PHẦN MỀM APPLE THỎA MÃN CÁC YÊU CẦU CỦA BẠN, RẰNG HOẠT ĐỘNG CỦA PHẦN MỀM APPLE HOẶC DỊCH VỤ KHÔNG BỊ GIÁN ĐOẠN HOẶC KHÔNG CÓ LỖI, RẰNG BẤT KỲ DỊCH VỤ NÀO SẼ ĐƯỢC TIẾP TỤC CUNG CẤP, RẰNG PHẦN MỀM APPLE HOẶC DỊCH VỤ SẼ ĐƯỢC KHẮC PHỤC, HOẶC PHẦN MỀM APPLE SẼ TƯƠNG THÍCH HOẶC LÀM VIỆC VỚI PHẦN MỀM, ỨNG DỤNG HOẶC DỊCH VỤ CỦA BẤT KỲ BÊN THỨ BA NÀO. VIỆC CÀI ĐẶT CỦA PHẦN MỀM APPLE NÀY CÓ THỂ ẢNH HƯỞNG ĐẾN TÍNH SẴN CÓ VÀ KHẢ NĂNG SỬ DỤNG PHẦN MỀM CỦA BÊN THỨ BA, CÁC ỨNG DỤNG HOẶC CÁC DỊCH VỤ CỦA BÊN THỨ BA, CŨNG NHƯ CÁC SẢN PHẨM VÀ DỊCH VỤ CỦA APPLE.. ";
"Part38" = "E.  BẠN THỪA NHẬN THÊM RẰNG PHẦN MỀM APPLE VÀ CÁC DỊCH VỤ KHÔNG ĐƯỢC TẠO RA ĐỂ HOẶC PHÙ HỢP CHO VIỆC SỬ DỤNG TRONG CÁC ĐIỀU KIỆN HOẶC MÔI TRƯỜNG MÀ VIỆC NỘI DUNG, DỮ LIỆU HOẶC THÔNG TIN ĐƯỢC CUNG CẤP BỞI PHẦN MỀM APPLE HOẶC CÁC DỊCH VỤ BỊ SAI SÓT, BỊ CHẬM TRỄ, CÓ LỖI HAY KHÔNG CHÍNH XÁC CÓ THỂ GÂY TỬ VONG, THƯƠNG TẬT, HOẶC THIỆT HẠI NGHIÊM TRỌNG VỀ VẬT CHẤT HOẶC MÔI TRƯỜNG, BAO GỒM NHƯNG KHÔNG GIỚI HẠN BỞI HOẠT ĐỘNG CỦA CÁC THIẾT BỊ HẠT NHÂN, ĐIỀU KHIỂN MÁY BAY HOẶC CÁC HỆ THỐNG THÔNG TIN LIÊN LẠC, ĐIỀU KHIỂN HÀNG KHÔNG, CỨU HỘ HOẶC HỆ THỐNG VŨ KHÍ. ";
"Part39" = "F.  KHÔNG CÓ BẤT KỲ THÔNG TIN HOẶC TƯ VẤN NÀO BẰNG VĂN BẢN HOẶC BẰNG LỜI NÓI CỦA APPLE HOẶC MỘT ĐẠI ĐIỆN CÓ THẨM QUYỀN CỦA APPLE CÓ THỂ TẠO RA MỘT BẢO ĐẢM. NẾU PHẦN MỀM APPLE HOẶC CÁC DỊCH VỤ CÓ LỖI, BẠN SẼ PHẢI CHỊU TOÀN BỘ CHI PHÍ CHO CÁC DỊCH VỤ, SỬA CHỮA HOẶC KHÔI PHỤC CẦN THIẾT. LUẬT MỘT SỐ QUỐC GIA KHÔNG CHO PHÉP VIỆC LOẠI TRỪ CÁC BẢO ĐẢM NGẦM ĐỊNH HOẶC HẠN CHẾ CÁC QUYỀN CỦA NGƯỜI TIÊU DÙNG THEO QUY ĐỊNH ÁP DỤNG, TRONG TRƯỜNG HỢP ĐÓ CÁC LOẠI TRỪ VÀ HẠN CHẾ TRÊN CÓ THỂ KHÔNG ÁP DỤNG ĐỐI VỚI BẠN.";
"Part40" = "7. Giới Hạn Trách Nhiệm. TRONG PHẠM VI MÀ LUẬT ÁP DỤNG KHÔNG CẤM, APPLE SẼ KHÔNG CÓ TRÁCH NHIỆM TRONG BẤT KỲ TRƯỜNG HỢP NÀO ĐỐI VỚI THƯƠNG TÍCH, HOẶC BẤT KỲ THIỆT HẠI NÀO DÙ LÀ NGẪU NHIÊN, ĐẶC BIỆT, GIÁN TIẾP HOẶC CÓ TÍNH NHÂN QUẢ, BAO GỒM MÀ KHÔNG GIỚI HẠN BỞI CÁC THIỆT HẠI DO TỔN THẤT VỀ LỢI NHUẬN, SAI LỆCH HOẶC MẤT DỮ LIỆU, KHÔNG TRUYỀN HOẶC NHẬN ĐƯỢC BẤT KỲ THÔNG TIN NÀO, GIÁN ĐOẠN KINH DOANH HOẶC BẤT KỲ THIỆT HẠI HOẶC TỔN THẤT THƯƠNG MẠI KHÁC, PHÁT SINH TỪ HOẶC LIÊN QUAN ĐẾN VIỆC SỬ DỤNG HOẶC KHÔNG THỂ SỬ DỤNG PHẦN MỀM APPLE VÀ CÁC DỊCH VỤ HOẶC BẤT KỲ PHẦN MỀM HOẶC CÁC ỨNG DỤNG CỦA BÊN THỨ BA LIÊN QUAN ĐẾN PHẦN MỀM APPLE, CHO DÙ THIỆT HẠI HAY TỔN THẤT ĐÓ BỊ GÂY RA NHƯ THẾ NÀO, BẤT KỂ TRÁCH NHIỆM PHÁT SINH THEO HÌNH THỨC NÀO (THEO HỢP ĐỒNG, NGOÀI HỢP ĐỒNG HOẶC THEO NGUYÊN TẮC NÀO KHÁC) VÀ NGAY CẢ KHI APPLE ĐÃ ĐƯỢC KHUYẾN CÁO VỀ KHẢ NĂNG XẢY RA CÁC THIỆT HẠI ĐÓ. LUẬT CỦA MỘT SỐ NƯỚC KHÔNG CHO PHÉP LOẠI TRỪ HOẶC HẠN CHẾ TRÁCH NHIỆM ĐỐI VỚI THƯƠNG TẬT, HOẶC THIỆT HẠI NGẪU NHIÊN HAY CÓ TÍNH NHÂN QUẢ, TRONG TRƯỜNG HỢP ĐÓ HẠN CHẾ NÀY CÓ THỂ KHÔNG ÁP DỤNG ĐỐI VỚI BẠN. Trong mọi trường hợp tổng trách nhiệm của Apple đối với các thiệt hại (trừ trường hợp luật áp dụng yêu cầu trong các trường hợp liên quan tới thương tật) không vượt quá năm mươi đô la (50 USD). Các hạn chế trên sẽ áp dụng ngay cả khi biện pháp khắc phục được nêu ở trên không đạt được mục tiêu chính của biện pháp khắc phục đó.";
"Part41" = "8. Quản Lý Xuất Khẩu. Bạn không được sử dụng hoặc bằng cách nào đó xuất khẩu hoặc tái xuất khẩu Phần Mềm Apple trừ khi được cho phép bởi luật của Hoa Kỳ và luật của (các) quốc gia mà tại đó Phần Mềm Apple được mua. Cụ thể là, nhưng không hạn chế bởi, Phần Mềm Apple không thể được xuất khẩu hoặc tái xuất khẩu vào (a) bất kỳ quốc gia nào bị Hoa Kỳ cấm vận hoặc (b) bất kỳ đối tượng nào trong danh sách Các Đối Tượng Bị Đối Xử Đặc Biệt của Cục Kho Bạc Hoa Kỳ hoặc Danh Sách Những Tổ Chức hoặc Cá Nhân Bị Khước Từ của Bộ Thương Mại Hoa Kỳ, hoặc bất kỳ danh sách đối tượng bị hạn chế nào khác. Bằng cách sử dụng Phần Mềm Apple, bạn cam kết và bảo đảm rằng bạn không ở tại bất kỳ quốc gia nào hoặc thuộc bất kỳ danh sách nào nêu trên. Bạn cũng đồng ý rằng bạn sẽ không sử dụng Phần Mềm Apple cho bất kỳ mục đích nào bị luật Hoa Kỳ cấm, bao gồm, và không giới hạn bởi phát triển, thiết kế, chế tạo hoặc sản xuất tên lửa, vũ khí hạt nhân, hóa học hoặc sinh học.";
"Part42" = "9. Chính Phủ là Người Sử Dụng Cuối Cùng. Phần Mềm Apple và tài liệu liên quan là “Các Hạng Mục Thương Mại”, như thuật ngữ này được định nghĩa tại 48 C.F.R. §2.101, bao gồm “Phần Mềm Máy Tính Thương Mại” và “Tài Liệu Phần Mềm Máy Tính Thương Mại”, như thuật ngữ này được định nghĩa tại 48 C.F.R. §12.212 hoặc 48 C.F.R. §227.7202, khi được áp dụng. Phù hợp với quy định tại mục 48 C.F.R. §12.212 hoặc 48 C.F.R. §227.7202-1 đến 227.7202-4, khi được áp dụng, Phần Mềm Máy Tính Thương Mại và Tài Liệu Phần Mềm Máy Tính Thương Mại được cấp cho những người sử dụng cuối cùng là Chính Phủ Mỹ (a) chỉ như Các Hạng Mục Thương Mại và (b) chỉ với các quyền như được cấp cho tất cả những người sử dụng cuối cùng khác theo các điều khoản và điều kiện được nêu trong Hợp Đồng Cấp Quyền Sử Dụng này. Các quyền không được công bố được bảo lưu theo luật bản quyền của Hoa Kỳ.";
"Part43" = "10. Luật Điều Chỉnh và Vô Hiệu Từng Phần. Hợp Đồng Cấp Quyền Sử Dụng này được điều chỉnh và giải thích theo Luật của Bang California, trừ các nguyên tắc xung đột pháp luật. Hợp Đồng Cấp Quyền Sử Dụng này sẽ không được điều chỉnh bởi Công Ước Liên Hợp Quốc về Hợp Đồng Mua Bán Hàng Hóa Quốc Tế, việc áp dụng Công Ước này bị loại trừ rõ ràng. Nếu bạn là người tiêu dùng tại Vương Quốc Anh, Hợp Đồng Cấp Quyền Sử Dụng này sẽ được điều chỉnh bởi luật tại vùng cư trú của bạn. Nếu vì một lý do nào đó mà tòa án có thẩm quyền thấy rằng bất kỳ quy định, hoặc phần nào đó trong Hợp Đồng Cấp Quyền Sử Dụng này không thể được thực thi, phần còn lại của Hợp Đồng Cấp Quyền Sử Dụng này vẫn tiếp tục có hiệu lực đầy đủ.";
"Part44" = "11. Toàn Bộ Hợp Đồng; Ngôn Ngữ Điều Chỉnh. Hợp Đồng Cấp Quyền Sử Dụng này tạo thành toàn bộ thỏa thuận giữa bạn và Apple liên quan đến Phần Mềm Apple, và thay thế toàn bộ các thỏa thuận về vấn đề này trước đó hoặc tại cùng thời điểm. Bất kỳ sửa chữa hoặc thay đổi nào của Hợp Đồng Cấp Quyền Sử Dụng này sẽ không có giá trị ràng buộc trừ khi sửa chữa hoặc thay đổi đó được lập thành văn bản và được Apple ký. Trong phạm vi mà pháp luật của quốc gia bạn không cấm, việc dịch Hợp Đồng Cấp Quyền Sử Dụng này được thực hiện để đáp ứng yêu cầu của quốc gia sở tại và trong trường hợp có mâu thuẫn giữa bản tiếng Anh và bản không phải bằng tiếng Anh, bản tiếng Anh của Hợp Đồng Cấp Quyền Sử Dụng này sẽ được ưu tiên.";
"Part45" = "12. Xác Nhận Của Bên Thứ Ba. Các phần của Phần Mềm Apple có thể sử dụng hoặc chứa phần mềm của bên thứ ba hoặc các tài liệu có bản quyền khác. Các thừa nhận, các điều khoản cấp quyền sử dụng và khước từ đối với tài liệu này nằm trong các tài liệu điện tử cho Phần Mềm Apple, và việc bạn sử dụng tài liệu này sẽ được điều chỉnh bởi các điều khoản tương ứng của các tài liệu đó.";
"Part46" = "EA1576";
"Part47" = "16/08/2018";